update: README add mermaid
